#include "loggerguard.h"

//-----------------------------------------------------------------------------
// Реализация конструктора LoggerGuard
//-----------------------------------------------------------------------------
LoggerGuard::LoggerGuard(const std::string& message, std::ostream& out)
    : message_(message), out_(out) {}

//-----------------------------------------------------------------------------
// Реализация деструктора LoggerGuard
//-----------------------------------------------------------------------------
LoggerGuard::~LoggerGuard() {
    out_ << message_ << std::endl; // Выводим сообщение с символом новой строки ??
}
