#include "logger_task.h"
#include "loggerguard.h"
#include <iostream>

//-----------------------------------------------------------------------------
// Эмуляция некоторой функции
//-----------------------------------------------------------------------------
int SomeFunction() {
    // Эмуляция работы ??
    return 1;
}

//-----------------------------------------------------------------------------
// Эмуляция другой функции
//-----------------------------------------------------------------------------
int SomeOtherFunction() {
    // Эмуляция работы ??
    return 1;
}

//-----------------------------------------------------------------------------
// Эмуляция финальной функции
//-----------------------------------------------------------------------------
int FinalFunction() {
    // Эмуляция работы ?
    return 1;
}

//-----------------------------------------------------------------------------
// Функция, использующая LoggerGuard для логирования завершения
//-----------------------------------------------------------------------------
int Function() {
    LoggerGuard logger("Function completed");
    int value = 1;
    try {
        value = SomeFunction();
        if (value == 0) {
            return value;
        }
        value = SomeOtherFunction();
        if (value == 0) {
            return value;
        }
        value = FinalFunction(); // Может выбросить исключение ??
    }
    catch (...) {
        throw; // Перебрасываем исключение дальше ??
    }
    return value;
}

//-----------------------------------------------------------------------------
// Функция для запуска демонстрации LoggerGuard
//-----------------------------------------------------------------------------
void runLoggerTask() {
    std::cout << "Запуск задачи LoggerGuard...\n";
    Function();
    std::cout << "Задача LoggerGuard завершена.\n";
}
