// tasks.cpp
#include "tasks.h"
#include <iostream>

void task1() {
    std::cout << "Выполняется задание 1\n";
    // Здесь код задания 1
}

void task2() {
    std::cout << "Выполняется задание 2\n";
    // Здесь код задания 2
}
void task3() {
    std::cout << "Выполняется подзадача B для задания 4\n";
    // Здесь код подзадачи B для задания 4
}
void task4a() {
    std::cout << "Выполняется подзадача A для задания 4\n";
    // Здесь код подзадачи A для задания 4
}

void task4b() {
    std::cout << "Выполняется подзадача B для задания 4\n";
    // Здесь код подзадачи B для задания 4
}
void task5() {
    std::cout << "Выполняется подзадача B для задания 4\n";
    // Здесь код подзадачи B для задания 4
}
void task6a() {
    std::cout << "Выполняется подзадача B для задания 4\n";
    // Здесь код подзадачи B для задания 4
}
void task6b() {
    std::cout << "Выполняется подзадача B для задания 4\n";
    // Здесь код подзадачи B для задания 4
}
void task7() {
    std::cout << "Выполняется подзадача B для задания 4\n";
    // Здесь код подзадачи B для задания 4
}
void task8() {
    std::cout << "Выполняется подзадача B для задания 4\n";
    // Здесь код подзадачи B для задания 4
}
void task9() {
    std::cout << "Выполняется подзадача B для задания 4\n";
    // Здесь код подзадачи B для задания 4
}
